# StairsRunStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..StairsRunStyle Property
StairsRun Class See Also
---
The style of the stairs run such as straight, winder, etc.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public StairsRunStyle StairsRunStyle { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StairsRunStyle As StairsRunStyle
	Get
```

Visual C++
---
```text
public:
property StairsRunStyle StairsRunStyle {
	StairsRunStyle get ();
}
```

# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace